---
kind: other
id: Methods.T:Autodesk.Revit.UI.TextBox
source: html/f572a888-359c-9520-eb91-425b3ebe519a.htm
---
# TextBox Methods

Determines whether the specified Object is equal to the current Object .